; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.6
; Author:	Ivan Stambolić <stamba@absolutok.net>
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode (UTF-8) format and Zip it to preserve formatting
;	E-mail new language files to jbreland@legroom.net for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents each %s variables is hardocded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&U redu"
CANCEL_BUT = "O&dustani"
MAIN_DEST_DIR_LABEL = "&Ciljana fascikla:"
MAIN_FILE_LABEL = "&Arhiva/instalacija koju je potrebnu raspakovati:"
MENU_FILE_LABEL = "&Fajl"
MENU_FILE_QUIT_LABEL = "I&zlaz"
MENU_EDIT_LABEL = "P&odešavanja"
MENU_EDIT_PREFS_LABEL = "&Opcije"
MENU_HELP_LABEL = "&Pomoć"
MENU_HELP_WEB_LABEL = "%s &Internet stranica"
PREFS_TITLE_LABEL = "Opcije"
PREFS_UNIEXTRACT_OPTS_LABEL = "Opcije programa Universal Extractor"
PREFS_HISTORY_LABEL = "Pamti ar&hive"
PREFS_FORMAT_OPTS_LABEL = "Specifične opcije formata"
PREFS_LANG_LABEL = "&Jezik"
PREFS_DEBUG_LABEL = "&Fascikla za izveštaj"
PREFS_WARN_EXECUTE_LABEL = "&Upozorenje pre pokretanja aplikacija"
PREFS_REMOVE_DUPE_LABEL = "Ukloni &duple fajlove "
PREFS_REMOVE_TEMP_LABEL = "Ukloni &privremene fajlove "
PREFS_APPEND_EXT_LABEL = "Dodaj fajlovima &nastavke koji nedostaju "
METHOD_ADMIN_RADIO = "%s administrativna instalacija"
METHOD_EXTRACTION_RADIO = "%s izvlačenje"
METHOD_HEADER = "%s izvlačenje"
METHOD_MSI_NOTE_LABEL = "Napomena:"
METHOD_MSI_REQUIRES_LABEL = "msi2xml zahteva"
METHOD_MSI_URL_LABEL = "'MSXML 4.0 Parser' podršku"
METHOD_RADIO_LABEL = " Metoda izvlačenja"
METHOD_SWITCH_RADIO = "%s parametar"
METHOD_NOTIS_RADIO = "Nije 'InstallShield' instalacija"
METHOD_TEXT_LABEL = "%s podržava sledeće metode izvlačenja %s paketa. Nažalost, ove metode nisu 100% pouzdane. Ako početna metoda nije uspela, pokrenite %n%s ponovo i odaberite drugu metodu."
METHOD_UNPACKER_RADIO = "%s raspakovanje"


; GUI control functions
DOES_NOT_EXIST = "ne postoji.%n"
EXTRACT_TO = "Izvuci u"
INVALID_DIR_SELECTED =  "%s nije dobra fascikla."
INVALID_FILE_SELECTED = "%s Molimo odaberite ispravan fajl."
OPEN_FILE = "Odabir fajla"
SELECT_FILE = "Odaberite fajl"
WRITE_TO = "Sačuvaj izveštaj u"


; Common terms
TERM_ARCHIVE = "arhiva"
TERM_COMPRESSED = "kompresovan fajl"
TERM_DISK = "disk"
TERM_EBOOK = "e-knjiga"
TERM_ECARD = "e-čestitka"
TERM_ENCODED = "zaštićen fajl"
TERM_EXECUTABLE = "izvršni fajl"
TERM_FAILED = "nije uspelo"
TERM_HELP = "Fajl pomoći"
TERM_HOTFIX = "zakrpa"
TERM_IMAGE = "slika"
TERM_INSTALLER = "instalacija"
TERM_PACKAGE = "paket"
TERM_PATCH = "zakrpa"
TERM_SFX = "Samo-raspakujuća"
TERM_STAGE = "Faza"
TERM_SUCCEEDED = "uspelo"
TERM_TESTING = "Testiranje"
TERM_UNKNOWN = "nepoznato"
TERM_UNPACKED = "raspakovano"
TERM_UPDATER = "nadogradnja"

; Status messages
SCANNING_FILE = "Određivanje tipa fajla."
SCANNING_EXE = "Skeniranje fajla sa %s"
EXTRACTING = "Izvlačenje fajla iz:"
INIT_WAIT = "Pokretanje instalacije.%nMolim sačekajte."


; Custom prompts
CONVERT_CDROM = "%s CD-ROM fajlovi ne mogu biti raspakovani direktno.%nUmesto toga, biće pretvorene u ISO fajl,%nkoji će biti raspakovan.%n%nŽelite li da nastavite?%nNapomena: Proces može potrajati i do nekoliko minuta."
CONVERT_CDROM_STAGE1_FAILED = "Greška:  CD-ROM fajl ne može biti pretvoren.%nAko su ovo BIN/CUE fajlovi, proverite da je CUE fajl pravilnog formata."
CONVERT_CDROM_STAGE2_FAILED = "Greška:  ISO fajl je kreiran iz%n%s, %nfajl ali ne može biti pretvoren.%nŽelite li da zadržite ISO fajl za dalju analizu?"
CONVERT_BIN_MISSING = "Greška:%n%s\%s.%s%nfajl nije pronađen.%n%nPotrebna su oba %s.bin i %s.cue fajla."
INIT_COMPLETE = "Pokretanje %s.  Molimo Vas da prekinete instalaciju, zatim odaberete 'U redu' za nastavak."
WISE_MSI_PROMPT = "Napomena:  Ova metoda funkcioniše samo za specifične 'Wise for Windows Installer' arhive.%nAko je pri pokretanju 'Wise Installation Wizard' potreban dalji unos, ovaj fajl nije podržan. %nMolimo prekinite instalaciju i %s će prekinuti izvlačenje.%n%nŽelite li da nastavite?"
UNPACK_PROMPT = "Ovaj fajl je zapakovan sa %s kompresijom,%nali ne može biti raspakovan.%nMogući uzrok je nepodržani tip fajla ili%nnema sadržanih fajlova za izvlačenje.%n%nŽelite li da umesto toga raspakujete ovaj fajl?%n%nNapomena: Raspakovani fajl će biti imenovan:%n%s\%s_unpacked.%s"
UNPACK_FAILED = "Greška: %s%nizvlačenje nije uspelo."
WARN_EXECUTE = "Upozorenje: %nDa bi se iz ove instalacione arhive izvukli fajlovi potrebno je pokrenuti instalaciju.%nAko želite da nastavite, izvršićemo sledeću komandu:%n%n%s%n%nAko smatrate da instalacija ne potiče iz pouzdanih izvora, pokretanje nije preporučeno.%nŽelite li da nastavite?"






; Help text
HELP_SUMMARY = "Izvlačenje fajlova iz bilo kog tipa arhive ili instalacione arhive."
HELP_SYNTAX = "%nUpotreba:  %s [/help] [fajl [ciljana fascikla]]"
HELP_ARGUMENTS = "%n%nPodržani argumenti:"
HELP_HELP = "%n     /help%t%tPrikaži ovu informaciju za pomoć"
HELP_FILENAME = "%n     fajl%tIme fajla koji treba raspakovati"
HELP_DESTINATION = "%n     ciljana fascikla%tFascikla za smeštanje izvučenih fajlova"
HELP_SUB = "%n%nZadavanje /sub umesto ciljane fascikle određuje %n%sda se fajlovi izvlače u podfasciklu imenovanu prema arhivi."
HELP_EXAMPLE1 = "%n%nPrimer:"
HELP_EXAMPLE2 = "%n     %s c:\1\primer.zip c:\test"
HELP_NOARGS = "%n%nPokretanje %s bez argumenata će zatražiti%nod korisnika ime fajla i ciljanu fasciklu."

; Error messages
CANNOT_LOG = "%s%nRaspakovanje ne može biti praćeno izveštajem."
CANNOT_DEBUG = "Izveštaj ne može biti sačuvan u %n"%s"%nUmesto toga, biće sačuvan u korisničku privremenu fasciklu."
CANNOT_EXTRACT = "%s%nfajl ne može biti raspakovan.%nNađeni tip fajla je: %s%n%nOdaberite 'U redu' ako želite svojeručno da analizirate fajl ili 'Odustani' za izlaz."
UNKNOWN_EXT = "%s%nfajl je nepoznatog tipa i ne može biti raspakovan."
INVALID_DIR = "%s%nfascikla ne može biti napravljena. Molimo odaberite ispravnu fasciklu."
EXTRACT_FAILED = "%s%nfajl ne može biti raspakovan.%nFajl liči na %s, što jeste podržani tip, ali izvlačenje nije uspelo.%nMolimo pogledajte izveštaj, %s, za više informacija.%n%nOdaberite 'U redu' da pogledate izveštaj sada, ili 'Odustani' za prekid."



[Installer]
; Components page
COMP_DOCS = "Informacije o dokumentaciji i licenciranju"
COMP_LANG = "Višejezični paket sa internacionalnom podrškom "
COMP_ACE = "Podrška za ACE fajlove"
COMP_KGB = "Podrška za KGB fajlove"
COMP_PEA = "Podrška za Pea fajlove"
COMP_SIT = "Podrška za StuffIt fajlove"

; Preferences page
PREFS_CAPTION = "Podešavanje opcija programa"
PREFS_DESCRIPTION = "Koje opcije Universal Extractora želite da podesite?"
PREFS_LABEL1 = "Možete podesite sledeće opcije za podešavanje rada Universal Extractor-a"
PREFS_LABEL2 = "Ove opcije se mogu promeniti posle instalacije menjanjem UniExtract.ini fajla."
LANGUAGE_LABEL = "Početni jezik"
DEBUG_LABEL = "Lokacija izveštaja"
APPEND_EXT_LABEL = "&Dodaj fajlovima nastavke koji nedostaju"
HISTORY_LABEL = "Pa&mti arhive"
REMOVE_DUPE_LABEL = "&Ukloni duple fajlove"
REMOVE_TEMP_LABEL = "Ukloni &privremene fajlove"
WARN_EXECUTE_LABEL = "&Upozorenje pre pokretanja aplikacija"


; Tasks page
ASSOCIATE = "&Integracija u Windows Explorer"
ASSOCIATE_FILES = "Dodaj 'UniExtract &Fajlovi...' u kontekstni meni"
ASSOCIATE_HERE = "Dodaj 'UniExtract &Ovde' u kontekstni meni"
ASSOCIATE_SUBDIR = "Dodaj 'UniExtract u &Podfasciklu' u kontekstni meni "
ASSOCIATE_FORCE = "Pridruži sv&e podržane formate arhiva"
MODIFY_PATH = "Dodaj Universal Extractor u &sistemsku liniju"
DESKTOP_ICON = "Dodaj ikonu na Desk&top"
QUICK_LAUNCH_ICON = "Dodaj &Quick Launch ikonu"
SENDTO_ICON = "Dodaj &Pošalji U  ikonu"

; Context Menu integration
EXTRACT_FILES = "UniExtract &Fajlovi..."
EXTRACT_HERE = "UniExtract &Ovde"
EXTRACT_SUB = "UniExtract u &Podfasciklu"
